# ============================================
# 题目2-1：三角形类型判断
# ============================================
# 定义一个函数 triangle_type(a, b, c)，判定三角形类型
# 1. 判断是否能构成三角形：任意两边之和大于第三边
# 2. 等边三角形：三边相等
# 3. 等腰三角形：两边相等
# 4. 普通三角形：三边都不相等
# ============================================

# 在下面写你的代码：
def triangle_type(a,b,c):
    if a + b > c and a + c > b and b + c > a:
        if a == b == c:
            return "等边三角形"
        elif a == b or a == c or b == c:
            return "等腰三角形"
        else:
            return "普通三角形"
    else:
        return "不能构成三角形"

print(triangle_type(3,3,999))


