# ============================================
# 题目2-1：分数等级判断
# ============================================
# 定义一个函数 get_grade(score)，根据传入的分数返回对应的等级：
# 1. 分数 >= 90：返回 "A"
# 2. 分数 >= 75：返回 "B"
# 3. 分数 >= 60：返回 "C"
# 4. 分数 < 60：返回 "D"
# ============================================

# 在下面写你的代码：


def get_grade(score):
    if score >= 90:
        return "A"
    elif score >= 75:
        return "B"
    elif score >= 60:
        return "C"
    else:
        return "D"


score = int(input("请输入："))

print(get_grade(score))


