# ============================================
# 题目4：元组推导式
# ============================================
# 完成以下操作：
# 1. 用元组推导式生成 1-10 的平方数 |---知识点：(表达式 for 变量 in 序列)---|
# 2. 将生成器转换为元组 |---知识点：tuple(生成器)---|
# ============================================
# 在下面写你的代码：

gen = (x**2 for x in range(1, 11))
print(gen)

t=tuple(gen)
print(t)


# ============================================
# 参考答案（写完后取消注释对比）
# ============================================
# # 生成器
# gen = (x**2 for x in range(1, 11))
# print(f"生成器对象: {gen}")
#
# # 转换为元组
# t = tuple(gen)
# print(f"元组: {t}")
