# ============================================
# 题目2-6：match...case 多条件
# ============================================
# 完成以下操作：
# 1. 输入 HTTP 状态码 status
# 2. 用 match...case 判断状态类型
# 3. 200：成功
# 4. 301 | 302：重定向
# 5. 404：未找到
# 6. 500 | 502 | 503：服务器错误
# 7. 其他：未知
# ============================================

# 在下面写你的代码：

status=int(input("请输入状态吗："))
match status:
    case 200:
        print("成功")
    case 301 | 302:
        print("重定向")
    case 404:
        print("未找到")
    case 500 | 502 | 503:
        print("服务器错误")
    case _:
        print("未知状态码")


